#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьОписаниеПодтверждения(ОписаниеПодтверждения, Объект, ДопПараметры) Экспорт
		
	_ЗаполнитьОписаниеПодтверждения(ОписаниеПодтверждения, Объект, ДопПараметры);
	
КонецПроцедуры 

Процедура ЗаполнитьОписаниеПодтвержденияПоФизЛицу(ОписаниеПодтверждения, Объект, ДопПараметры) Экспорт
		
	// TODO
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция _ЗаполнитьОписаниеПодтверждения(ОписаниеПодтверждения, Сотрудник, ДопПараметры)

	ДанныеФл = _СформироватьДанныеФизЛица(Сотрудник.ФизическоеЛицо);
	ДанныеЮл = _СформироватьДанныеЮл(Сотрудник.ГоловнаяОрганизация);
	
	ОписаниеПодтверждения.СотрудникФио = ДанныеФл.Фио;
	ОписаниеПодтверждения.СотрудникСнилс = ДанныеФл.Снилс;
	ОписаниеПодтверждения.СотрудникНомерПаспорта = ДанныеФл.НомерПаспорта;
	ОписаниеПодтверждения.СотрудникСерияПаспорта = ДанныеФл.СерияПаспорта; 
	
	ОписаниеПодтверждения.ОрганизацияНаименование = ДанныеЮл.Наименование; 
	ОписаниеПодтверждения.ОрганизацияИНН = ДанныеЮл.ИНН; 
	ОписаниеПодтверждения.ГенДирФИО = ДанныеЮл.ФиоРуководителя; 
	ОписаниеПодтверждения.ГенДирСНИЛС = ДанныеЮл.СнилсРуководителя;
	
КонецФункции

Функция _СформироватьДанныеФизЛица(ФизЛицо)

	Результат = _ОпределениеФизЛица();
	
	Запрос = Новый Запрос;
	Запрос.Текст = _ТекстЗапросаДанныеФизЛица();
	
	Запрос.УстановитьПараметр("Объект", ФизЛицо);
	Запрос.УстановитьПараметр("ВидДокумента", Вычислить("Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ")); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);	
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция _СформироватьДанныеЮл(Организация)

	Результат = _ОпределениеЮл();
	
	Запрос = Новый Запрос;
	Запрос.Текст = _ТекстЗапросаДанныеЮл();
	
	Запрос.УстановитьПараметр("Объект", Организация); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);	
	КонецЕсли;
	
	Возврат Результат;	
	
КонецФункции

Функция _ТекстЗапросаДанныеФизЛица()

	Результат = 
	"ВЫБРАТЬ 
	|	ФизическиеЛица.ФИО КАК ФИО,
	|	ФизическиеЛица.СтраховойНомерПФР КАК Снилс,
	|	ДокументыФизическихЛицСрезПоследних.Номер КАК НомерПаспорта,
	|	ДокументыФизическихЛицСрезПоследних.Серия КАК СерияПаспорта
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица,
	|	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних КАК ДокументыФизическихЛицСрезПоследних
	|ГДЕ
	|	ФизическиеЛица.Ссылка = &Объект
	|	И ДокументыФизическихЛицСрезПоследних.ВидДокумента = &ВидДокумента";
	
	Возврат Результат;
	
КонецФункции 

Функция _ТекстЗапросаДанныеЮл()

	Результат = 
	"ВЫБРАТЬ
	|	СведенияОбОтветственныхЛицахСрезПоследних.Руководитель.ФИО КАК ФиоРуководителя,
	|	СведенияОбОтветственныхЛицахСрезПоследних.Руководитель.СтраховойНомерПФР КАК СнилсРуководителя,
	|	СведенияОбОтветственныхЛицахСрезПоследних.Организация.НаименованиеПолное КАК Наименование,
	|	СведенияОбОтветственныхЛицахСрезПоследних.Организация.ИНН КАК ИНН
	|ИЗ
	|	РегистрСведений.СведенияОбОтветственныхЛицах.СрезПоследних КАК СведенияОбОтветственныхЛицахСрезПоследних";
	
	Возврат Результат;	
	
КонецФункции

Функция _ОпределениеФизЛица()

	Результат = Новый Структура;
	Результат.Вставить("ФИО");
	Результат.Вставить("СерияПаспорта");
	Результат.Вставить("НомерПаспорта");
	Результат.Вставить("Снилс");
	
	Возврат Результат;
	
КонецФункции

Функция _ОпределениеЮл()

	Результат = Новый Структура;
	Результат.Вставить("Наименование");
	Результат.Вставить("ИНН");
	Результат.Вставить("ФиоРуководителя");
	Результат.Вставить("СнилсРуководителя");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти