#Область ПрограммныйИнтерфейс

Функция КакCSV(ОписаниеПодтверждения, ДопПараметры = Неопределено) Экспорт
	
	ТекстCSV = "";
	
	РазделительКолонок = ";";
	РазделительСтрок = Символы.ВК + Символы.ПС;
	Кавычки = """";
	
	ИменаСтолбцовДляCSV = ИменаСтолбцовДляCSV();
	
	Для Каждого Элемент Из ИменаСтолбцовДляCSV Цикл
		
		Если Элемент.Имя = "ПустаяСтрока" Тогда
			ТекстCSV = ТекстCSV + РазделительКолонок + РазделительСтрок;
			Продолжить;
		КонецЕсли;
		
		ИмяСтолбца = Элемент.ИмяДляCSV;
		ЗначениеСтолбца = ОписаниеПодтверждения[Элемент.Имя];
		
		Если ТипЗнч(ИмяСтолбца) = Тип("Массив") Тогда
			Для Каждого ИмяПодраздел Из ИмяСтолбца Цикл
				ТекстCSV = ТекстCSV + ЭкранироватьСлужебныеСисмволы(ИмяПодраздел, РазделительКолонок, РазделительСтрок, Кавычки)
					+ РазделительКолонок
					+ ЭкранироватьСлужебныеСисмволы(ЗначениеСтолбца, РазделительКолонок, РазделительСтрок, Кавычки)
					+ РазделительСтрок;
			КонецЦикла;
			Продолжить;
		КонецЕсли;
		
		ТекстCSV = ТекстCSV + ЭкранироватьСлужебныеСисмволы(ИмяСтолбца, РазделительКолонок, РазделительСтрок, Кавычки)
			+ РазделительКолонок
			+ ЭкранироватьСлужебныеСисмволы(ЗначениеСтолбца, РазделительКолонок, РазделительСтрок, Кавычки)
			+ РазделительСтрок;
		
	КонецЦикла;
	
	Возврат ТекстCSV;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

//

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЭкранироватьСлужебныеСисмволы(Строка, РазделительКолонок, РазделительСтрок, Кавычки)
	
	Если Найти(Строка, Кавычки) Тогда
		Строка = СтрЗаменить(Строка, Кавычки, Кавычки + Кавычки);
	КонецЕсли;
	
	Если Найти(Строка, РазделительКолонок) ИЛИ Найти(Строка, РазделительСтрок) ИЛИ Найти(Строка, Кавычки) Тогда
		Строка = Кавычки + Строка + Кавычки;
	КонецЕсли;
	
	Возврат Строка;
	
КонецФункции

Функция ИменаСтолбцовДляCSV()
	
	Результат = Новый ТаблицаЗначений;
	
	Результат.Колонки.Добавить("Имя");
	Результат.Колонки.Добавить("ИмяДляCSV");
	
	СтрокаТаблицы = Результат.Добавить();
	СтрокаТаблицы.Имя = "ОрганизацияНаименование";
	СтрокаТаблицы.ИмяДляCSV = "Наименование ЮЛ";
	
	
	СтрокаТаблицы = Результат.Добавить();
	СтрокаТаблицы.Имя = "ОрганизацияИНН";
	СтрокаТаблицы.ИмяДляCSV = "ИНН ЮЛ";
	
	СтрокаТаблицы = Результат.Добавить();
	СтрокаТаблицы.Имя = "МобТелефонОтветсвенногоКадры";
	СтрокаТаблицы.ИмяДляCSV = "Мобильный телефон ответственного сотрудника кадровой службы";
	
	СтрокаТаблицы = Результат.Добавить();
	СтрокаТаблицы.Имя = "МобТелефонГенДирИлиИспОрган";
	СтрокаТаблицы.ИмяДляCSV = "Мобильной телефон генерального директора или иного единоличного исполнительного органа";
	
	СтрокаТаблицы = Результат.Добавить();
	СтрокаТаблицы.Имя = "ГенДирФИО";
	СтрокаТаблицы.ИмяДляCSV = "ФИО генерального директора или иного единоличного исполнительного органа";
	
	СтрокаТаблицы = Результат.Добавить();
	СтрокаТаблицы.Имя = "ГенДирСНИЛС";
	СтрокаТаблицы.ИмяДляCSV = "СНИЛС генерального директора или иного единоличного исполнительного органа";
	
	СтрокаТаблицы = Результат.Добавить();
	СтрокаТаблицы.Имя = "ПустаяСтрока";
	
	СтрокаТаблицы = Результат.Добавить();
	СтрокаТаблицы.Имя = "СотрудникФИО";
	СтрокаТаблицы.ИмяДляCSV = "ФИО сотрудника";
	
	СтрокаТаблицы = Результат.Добавить();
	СтрокаТаблицы.Имя = "СотрудникСерияПаспорта";
	СтрокаТаблицы.ИмяДляCSV = "Серия паспорта сотрудника";
	
	СтрокаТаблицы = Результат.Добавить();
	СтрокаТаблицы.Имя = "СотрудникНомерПаспорта";
	СтрокаТаблицы.ИмяДляCSV = "№ паспорта сотрудника";
	
	СтрокаТаблицы = Результат.Добавить();
	СтрокаТаблицы.Имя = "СотрудникСНИЛС";
	СтрокаТаблицы.ИмяДляCSV = "СНИЛС сотрудника";
	
	СтрокаТаблицы = Результат.Добавить();
	СтрокаТаблицы.Имя = "ПустаяСтрока";
	
	СтрокаТаблицы = Результат.Добавить();
	СтрокаТаблицы.Имя = "ТекстПодтверждение";
	СтрокаТаблицы.ИмяДляCSV = ПолучитьТекстРаздела("ТекстПодтверждение");
	
	СтрокаТаблицы = Результат.Добавить();
	СтрокаТаблицы.Имя = "ПустаяСтрока";
	
	СтрокаТаблицы = Результат.Добавить();
	СтрокаТаблицы.Имя = "ТекстПредоставлениеПрава";
	СтрокаТаблицы.ИмяДляCSV = ПолучитьТекстРаздела("ТекстПредоставлениеПрава");
	
	СтрокаТаблицы = Результат.Добавить();
	СтрокаТаблицы.Имя = "ПустаяСтрока";
	
	СтрокаТаблицы = Результат.Добавить();
	СтрокаТаблицы.Имя = "ТекстПредупреждениеОбОтветсвенности";
	СтрокаТаблицы.ИмяДляCSV = "Предупреждён об ответственности за предоставление неактуальной или недостоверной информации, используемой для решения вопроса о непривлечении сотрудника к призыву на военную службу по мобилизации в соответствии с законодательством Российской Федерации";
	
	СтрокаТаблицы = Результат.Добавить();
	СтрокаТаблицы.Имя = "ТекстПредупредилОбОтветсвенностиСотрудника";
	СтрокаТаблицы.ИмяДляCSV = "Предупредил сотрудника об ответственности за предоставление неактуальной или недостоверной информации при заполнении формы на едином портале государственных услуг, в соответствии с законодательством Российской Федерации";
	
	СтрокаТаблицы = Результат.Добавить();
	СтрокаТаблицы.Имя = "ПустаяСтрока";
	
	СтрокаТаблицы = Результат.Добавить();
	СтрокаТаблицы.Имя = "ТексПодписиГенДирИлиИспОрган";
	СтрокаТаблицы.ИмяДляCSV = "Настоящая форма подписана генеральным директором или иным единоличным исполнительным органом организации его усиленной квалифицированной электронной подписью (как должностного лица организации)";
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьТекстРаздела(ИмяРаздела)
	
	Результат = Новый Массив;
	
	Если ИмяРаздела = "ТекстПодтверждение" Тогда
		Результат.Добавить("Подтверждаю, что сотрудник:");
		Результат.Добавить("— работает в организации по трудовому договору с нормальной продолжительностью рабочего времени или ненормированным рабочим днем;");
		Результат.Добавить("— задействован в разработке, развитии, внедрении, сопровождении и эксплуатации решений в области информационных технологий и обеспечения функционирования информационной инфраструктуры и (или) в обеспечении устойчивости, безопасности и целостности функционирования сооружений связи, центров обработки данных, а также средств и линий связи общего пользования Российской Федерации;");
		Результат.Добавить("— имеет необходимое соответствующее высшее образование для выполнения своих обязанностей")
	ИначеЕсли ИмяРаздела = "ТекстПредоставлениеПрава" Тогда
		Результат.Добавить("Предоставляю право сотруднику от имени организации:");
		Результат.Добавить("— заполнить данные о стаже, воинском учете и дипломе, а также другие данные в соответствии с формой на включение в список для получения отсрочки от мобилизации, размещенной на едином портале государственных услуг;");
		Результат.Добавить("— подать с использованием единого портала государственных услуг заявление на себя о включении в список для получения отсрочки от мобилизации");
	Иначе
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти