#Область Тесты

&НаСервере
Процедура ЗаполнитьОписаниеПодтверждения() Экспорт
	
	ОписаниеПодтверждения = Вычислить("МИтКС").ОписаниеПодтверждения();	
	ДопПараметры = Неопределено;	
	ФизЛицо = Справочники.Сотрудники.НайтиПоКоду("0000-00030");
	
	Обработки.МИтТест.Хранилище().ЗаполнитьОписаниеПодтверждения(ОписаниеПодтверждения, ФизЛицо, ДопПараметры);
	
	Если ОписаниеПодтверждения.ОрганизацияИНН <> "9937548836" Тогда 
		ВызватьИсключение "Ошибка формирования: неверный ИНН организации";
	КонецЕсли;
	
	Если ОписаниеПодтверждения.СотрудникФИО <> "Бажова Светлана Нурисламовна" Тогда 
		ВызватьИсключение "Ошибка формирования: неверный ФМО объекта";
	КонецЕсли;
	
	Если ОписаниеПодтверждения.СотрудникСНИЛС <> "145-434-285 57" Тогда 
		ВызватьИсключение "Ошибка формирования: неверный СНИЛС сотрудника";
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти


