#Область ПрограммныйИнтерфейс

Процедура МИтПодготовкаПодтверждения(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт
	
	ПараметрыПодготовки = Новый Структура;
    ПараметрыПодготовки.Вставить("Сотрудники", Новый Массив);
	ПараметрыПодготовки.Вставить("ФизическиеЛица", Новый Массив);

	Для Каждого Элемент Из ПараметрКоманды Цикл

		Если ТипЗнч(Элемент) = Тип("СправочникСсылка.Сотрудники") Тогда
			ПараметрыПодготовки.Сотрудники.Добавить(Элемент);	
		ИначеЕсли ТипЗнч(Элемент) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			ПараметрыПодготовки.ФизическиеЛица.Добавить(Элемент);	
		Иначе
			Продолжить;	
		КонецЕсли;
		
	КонецЦикла;
	
	ОткрытьФорму("Обработка.МИтПодготовкаПодтверждения.Форма.Форма", ПараметрыПодготовки); 
	
КонецПроцедуры

Функция МИтПодписатьДвоичныеДанные(ДовичныеДанные, Сертификат, ОбработчикЗавершения) Экспорт
	
	ИмяФайла = "ОписаниеПодтверждения";  
	
	ОписаниеДанных = Новый Структура;
	ОписаниеДанных.Вставить("Операция", НСтр("ru = 'Подписание файла'"));
	ОписаниеДанных.Вставить("ЗаголовокДанных", НСтр("ru = 'Файл'"));
	ОписаниеДанных.Вставить("Данные", ДовичныеДанные); 
	ОписаниеДанных.Вставить("ОтборСертификатов", Сертификат); 
	ОписаниеДанных.Вставить("БезПодтверждения", Истина);
	ОписаниеДанных.Вставить("Представление", ИмяФайла);
	ОписаниеДанных.Вставить("СписокПредставлений", Новый СписокЗначений());
	ОписаниеДанных.СписокПредставлений.Добавить(, ИмяФайла);
	
	ЭлектроннаяПодписьКлиент.Подписать(ОписаниеДанных,, ОбработчикЗавершения);
	
КонецФункции

#КонецОбласти