#Область ПрограммныйИнтерфейс

Процедура МИтПодготовкаПодтверждения(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт
	
	ПараметрыПодготовки = Новый Структура;
    ПараметрыПодготовки.Вставить("Сотрудники", Новый Массив);
	ПараметрыПодготовки.Вставить("ФизическиеЛица", Новый Массив);

	Для Каждого Элемент Из ПараметрКоманды Цикл

		Если ТипЗнч(Элемент) = Тип("СправочникСсылка.Сотрудники") Тогда
			ПараметрыПодготовки.Сотрудники.Добавить(Элемент);	
		ИначеЕсли ТипЗнч(Элемент) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			ПараметрыПодготовки.ФизическиеЛица.Добавить(Элемент);	
		Иначе
			Продолжить;	
		КонецЕсли;
		
	КонецЦикла;
	
	ОткрытьФорму("Обработка.МИтПодготовкаПодтверждения.Форма.Форма", ПараметрыПодготовки); 
	
КонецПроцедуры
 
#КонецОбласти