#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Элементы.РедактироватьФормы.Пометка = Ложь;	
	
	Для Каждого Сотрудник Из Параметры.Сотрудники Цикл		
		Строка = ТаблицаСостояние.Добавить();
		Строка.Организация = Сотрудник.ГоловнаяОрганизация;
		Строка.ФизЛицо = Сотрудник.ФизическоеЛицо;
		Строка.Сотрудник = Сотрудник;		
	КонецЦикла;

	Для Каждого ФизическоеЛицо Из Параметры.ФизическиеЛица Цикл
  		Строка = ТаблицаСостояние.Добавить();
		Строка.ФизЛицо = ФизическоеЛицо;		
	КонецЦикла;	
	
	_ОбновитьФормуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьФормы(Команда)

	Элементы.РедактироватьФормы.Пометка = НЕ Элементы.РедактироватьФормы.Пометка;

	_ОбновитьФормуНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФормы(Команда)

	Для Каждого Строка Из ТаблицаСостояние Цикл		
		Данные = _ДанныеЗаполненияФормы(Строка.Сотрудник, Строка.ФизЛицо, Строка.Организация);		
		ЗаполнитьЗначенияСвойств(Строка, Данные);		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура _ОбновитьФормуНаСервере()

	СостояниеФормы = _СостояниеФормы();
    СостояниеФормы.РедактироватьФормы = Элементы.РедактироватьФормы.Пометка;
	
	_ОбновитьФорму(ЭтаФорма, СостояниеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура _ОбновитьФормуНаКлиенте()
	
	СостояниеФормы = _СостояниеФормы();
    СостояниеФормы.РедактироватьФормы = Элементы.РедактироватьФормы.Пометка;
	
	_ОбновитьФорму(ЭтаФорма, СостояниеФормы);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура _ОбновитьФорму(Форма, СостояниеФормы)

	Форма.Элементы.ТаблицаСостояниеФорма.Видимость = СостояниеФормы.РедактироватьФормы;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция _ДанныеЗаполненияФормы(Сотрудник, ФизЛицо, Организация)

	Если ЗначениеЗаполнено(Сотрудник) Тогда
		Результат = МИт.ОписаниеПодтвержденияПоСотруднику(Сотрудник);	
	ИначеЕсли ЗначениеЗаполнено(ФизЛицо) Тогда
		Результат = МИт.ОписаниеПодтвержденияПоФизЛицу(ФизЛицо, Организация);	
	Иначе
		ВызватьИсключение "Ошибка";	
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция _СостояниеФормы() Экспорт

	Модель = Новый Структура;
	Модель.Вставить("РедактироватьФормы", Ложь);	

	Возврат Модель;
	
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
