#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Элементы.РедактироватьФормы.Пометка = Ложь;	
	
	//
	
	_ОбновитьФормуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьФормы(Команда)

	Элементы.РедактироватьФормы.Пометка = НЕ Элементы.РедактироватьФормы.Пометка;

	_ОбновитьФормуНаКлиенте();
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура _ОбновитьФормуНаСервере()

	СостояниеФормы = _СостояниеФормы();
    СостояниеФормы.РедактироватьФормы = Элементы.РедактироватьФормы.Пометка;
	
	_ОбновитьФорму(ЭтаФорма, СостояниеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура _ОбновитьФормуНаКлиенте()
	
	СостояниеФормы = _СостояниеФормы();
    СостояниеФормы.РедактироватьФормы = Элементы.РедактироватьФормы.Пометка;
	
	_ОбновитьФорму(ЭтаФорма, СостояниеФормы);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура _ОбновитьФорму(Форма, СостояниеФормы)

	Форма.Элементы.ТаблицаСостояниеФорма.Видимость = СостояниеФормы.РедактироватьФормы;
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция _СостояниеФормы() Экспорт

	Модель = Новый Структура;
	Модель.Вставить("РедактироватьФормы", Ложь);	

	Возврат Модель;
	
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
