#Область Тесты

&НаСервере
Процедура ПодтверждениеКакCSV() Экспорт
	
	ОписаниеПодтверждения = Вычислить("МИтКС").ОписаниеПодтверждения();
	ЗаполнитьОписаниеПодтверждения(ОписаниеПодтверждения);
	ДопПараметры = Неопределено;	
	
	Макет = Обработки.МИтТест.ПолучитьМакет("ОбразецЗаполнения20220927");
	ОбразецЗаполнения = СтрЗаменить(Макет.ПолучитьТекст(), Символы.ПС, Символы.ВК + Символы.ПС) ;
	
	Результат = Обработки.МИтТест.Подтверждение().КакCSV(ОписаниеПодтверждения, ДопПараметры);	
	
	Если ОбразецЗаполнения <> Результат Тогда
		ВызватьИсключение "Ошибка";
	КонецЕсли;
		
КонецПроцедуры

&НаСервере  
Процедура ЗаполнитьОписаниеПодтверждения(ОписаниеПодтверждения)

	ОписаниеПодтверждения.ОрганизацияНаименование = "ООО ""ИТ""";
	ОписаниеПодтверждения.ОрганизацияИНН = "1234567890" ;
	
	ОписаниеПодтверждения.МобТелефонОтветсвенногоКадры = "89991234567";
	ОписаниеПодтверждения.МобТелефонГенДирИлиИспОрган = "89991234567";
	
	ОписаниеПодтверждения.ГенДирФИО = "Иванов Иван Иванович";
	ОписаниеПодтверждения.ГенДирСНИЛС = "123-123-123 00";
	
	ОписаниеПодтверждения.СотрудникФИО = "Иванов Петр Петрович";
	ОписаниеПодтверждения.СотрудникСерияПаспорта = "1234";
	ОписаниеПодтверждения.СотрудникНомерПаспорта = "123456";; 
	ОписаниеПодтверждения.СотрудникСНИЛС = "123-123-123 00"
	
КонецПроцедуры                                     

#КонецОбласти
